app/Services/Cart/CartService.php

update `carts` set `quantity` = 4, `carts`.`updated_at` = '2024-09-07 21:20:06' where `id` = 10
---
    function update(int|string $id,array $data, array $option = []){
        try {
            $cart = $this->cartRepository->find($id);
            $cart->quantity = $data['quantity'];
            $cart->save();