app/Services/Product/ProductService.php

select * from `products` where `products`.`id` = '30' and `products`.`deleted_at` is null limit 1
---
    public function findById(int|string $id)
    {
        $product = $this->productRepository->find($id);

select * from `attributes` where `attributes`.`id` = 1 and `attributes`.`deleted_at` is null limit 1
select `products`.*, `category_product`.`category_id` as `pivot_category_id`, `category_product`.`product_id` as `pivot_product_id` from `products` inner join `category_product` on `products`.`id` = `category_product`.`product_id` where `category_product`.`category_id` = 1 and `products`.`deleted_at` is null order by `qty_sold` desc limit 3
---
    public function productDetail(int|string $id){
        $product = $this->productRepository->query()->find($id);
        if(!$product) throw new ModelNotFoundException('Product not found');
        if($product->variations){
            $attributes = [];
            foreach ($product->variations as $variation) {
                foreach ($variation->values as $value){
                    $attributes[$value->attribute->id]['id'] = $value->attribute->id;
                    $attributes[$value->attribute->id]['name'] = $value->attribute->name;
                    $attributes[$value->attribute->id]['values'][] = [
                        'id' => $value->id,
                        'value' => $value->value,
                    ];
                }
            }
            // automatically assign attributes
            $product->attributes = [...$attributes];
        }
        $productRelated = [];
        if($product->categories){
            foreach ($product->categories as $category){
                foreach ($category->products()->orderBy('qty_sold','desc')->take(3)->get() as $p)

select * from `attributes` where (`attributes`.`product_id` = 1 and `attributes`.`product_id` is not null or `product_id` is null) and `attributes`.`deleted_at` is null
---
    public function productAttribute(int|string $id){
        $product = $this->productRepository->find($id);
        if(!$product) throw new ModelNotFoundException('Product not found');
        $attributes = $product->ownAttributes()->orWhere('product_id',null)->get();